DataProcessors/упРМСпутниковыйМониторинг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>упРМСпутниковыйМониторинг</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Catalogs/упВариантыНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упВариантыНастроек</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючВарианта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоДляАвтора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/упРМСпутниковыйМониторинг/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс	

// Вызывается при переходе на версию конфигурации 3.0.2.89
//
Процедура ОбновитьПараметрыМониторингаОтображатьТрекЦветомПоСкоростиДвижения() Экспорт
	                                   
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	упВариантыНастроек.КлючВарианта
	|ИЗ
	|	Справочник.упВариантыНастроек КАК упВариантыНастроек
	|ГДЕ
	|	упВариантыНастроек.Объект = ""Обработка.упРМСпутниковыйМониторинг.ПараметрыМониторингаРейсов""
	|	И НЕ упВариантыНастроек.ПометкаУдаления";
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			СохраненныеНастройки = ХранилищаНастроек.упХранилищеНастроек.Загрузить("Обработка.упРМСпутниковыйМониторинг.ПараметрыМониторингаРейсов", Выборка.КлючВарианта);
			Если СохраненныеНастройки <> Неопределено Тогда
				СохраненныеНастройки.Вставить("ОтображатьТрекЦветомПоСкоростиДвиженияРейсы",Ложь);
				СохраненныеНастройки.Вставить("ЦветоваяШкалаРейсы", Справочники.упЦветовыеШкалы.ПустаяСсылка());
				ХранилищаНастроек.упХранилищеНастроек.Сохранить("Обработка.упРМСпутниковыйМониторинг.ПараметрыМониторингаРейсов", Выборка.КлючВарианта, СохраненныеНастройки);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	упВариантыНастроек.КлючВарианта
	|ИЗ
	|	Справочник.упВариантыНастроек КАК упВариантыНастроек
	|ГДЕ
	|	упВариантыНастроек.Объект = ""Обработка.упРМСпутниковыйМониторинг.ПараметрыМониторингаТранспорта""
	|	И НЕ упВариантыНастроек.ПометкаУдаления";
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			СохраненныеНастройки = ХранилищаНастроек.упХранилищеНастроек.Загрузить("Обработка.упРМСпутниковыйМониторинг.ПараметрыМониторингаТранспорта", Выборка.КлючВарианта);
			Если СохраненныеНастройки <> Неопределено Тогда
				СохраненныеНастройки.Вставить("ОтображатьТрекЦветомПоСкоростиДвиженияТС",Ложь);
				СохраненныеНастройки.Вставить("ЦветоваяШкалаТС", Справочники.упЦветовыеШкалы.ПустаяСсылка());
				ХранилищаНастроек.упХранилищеНастроек.Сохранить("Обработка.упРМСпутниковыйМониторинг.ПараметрыМониторингаТранспорта", Выборка.КлючВарианта, СохраненныеНастройки);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//Обработчик = Обработчики.Добавить();
	//Обработчик.НачальноеЗаполнение     = Ложь;
	//Обработчик.Версия                  = "3.0.2.89";
	//Обработчик.ОбщиеДанные             = Ложь;
	//Обработчик.УправлениеОбработчиками = Ложь;
	//Обработчик.Комментарий             = НСтр("ru = 'Обновление настроек параметров режимов мониторинга ""Мониторинг рейсов"" и ""Мониторинг транспорта""'");
	//Обработчик.РежимВыполнения         = "Оперативно";
	//Обработчик.Процедура               = "упОбновлениеИнформационнойБазы.ОбновитьПараметрыМониторингаОтображатьТрекЦветомПоСкоростиДвижения";
	
КонецПроцедуры // ОбновитьПараметрыМониторингаОтображатьТрекЦветомПоСкоростиДвижения()

#КонецОбласти

#КонецЕсли
